# GUID Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalDefinitionCreationOptions..::..GUID Property
ExternalDefinitionCreationOptions Class See Also
---
The GUID to use for this parameter definition. If not explicitly set, a random GUID is used.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public Guid GUID { get; set; }
```

Visual Basic
---
```text
Public Property GUID As Guid
	Get
	Set
```

Visual C++
---
```text
public:
property Guid GUID {
	Guid get ();
	void set (Guid value);
}
```

# See Also
ExternalDefinitionCreationOptions Class
Autodesk.Revit.DB Namespace